package Lab;

import java.util.Map;

public class Main {

    public static void main(String[] args) {

        Words words = new Words(words());

        for (Map.Entry<String, Integer> o: words.wordsCount().entrySet()) {
            System.out.println(o.getKey() + ": " + o.getValue());
        }
    }

    public static String[] words(){
        return new String[]{
                "абажур",
                "аббревиатура",
                "абитуриент",
                "абонемент",
                "аборт",
                "абракадабра",
                "абсент*",
                "авария",
                "авгур*",
                "автокефалия",
                "бурлак",
                "агломерат",
                "аграф*",
                "адепт",
                "адмирал*",
                "ажиотаж",
                "азарт",
                "акант",
                "аквилон*",
                "аккламация",
                "акколада",
                "аккордеон*",
                "аккордеон*",
                "акрибия",
                "акробатика",
                "бунгало*",
                "бунчук",
                "буран",
                "аборт",
                "бурлак",
                "бурлеск",
                "абракадабра",
                "бурт",
                "бурый",
                "бустрофедон",
                "бутафория",
                "абракадабра",
                "буханка*",
                "бухта",
                "бухта",
                "бучарда*",
                "аборт"

        };
    }
}
